alma_sw/tutorials.org
* Cómo hacer deployment de herramientas offline en preproducción

1. Conectar por SSH a máquina de configuraciones

#+BEGIN_SRC sh
ssh root@adrastea.sco.alma.cl
#+END_SRC

2. Descargar tar con release del branch a hacer deployment

3. Conectar por SSH a la máquina correspondiente al componente a desplegar

#+BEGIN_SRC sh
ssh root@eduarda.sco.alma.cl
#+END_SRC

4. Hacer backup de aplicación previa

#+BEGIN_SRC sh
cd /usr/local/tomcat;
cp -rp webapps webapps-$(date +%Y%m%d);
#+END_SRC

5. Bajar servidor Tomcat

#+BEGIN_SRC sh
supervisorctl stop tomcat
#+END_SRC

6. Eliminar archivos de aplicación anterior

#+BEGIN_SRC sh
cd webapps;
rm -rf *;
#+END_SRC

7. Copiar desde máquina de configuraciones archivo WAR de aplicación

#+BEGIN_SRC sh
rsync -a root@adrastea.sco.alma.cl:/alma/ACS-2016.5/ACSSW-201608-CYCLE4-OFF-B-2016-09-15-19-00-00/lib/cas-server-webapp.war .
#+END_SRC

8. Lanzar servidor Tomcat

#+BEGIN_SRC sh                                                                                                      
supervisorctl start tomcat
#+END_SRC
